-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- ホスト: 127.0.0.1
-- 生成日時: 2020-08-02 09:57:37
-- サーバのバージョン： 10.4.11-MariaDB
-- PHP のバージョン: 7.4.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `mydb`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `時刻表`
--

CREATE TABLE `時刻表` (
  `id` int(11) NOT NULL,
  `出発場所` varchar(10) NOT NULL,
  `出発時間` time NOT NULL,
  `到着時間` time NOT NULL,
  `運行ダイヤ` varchar(10) NOT NULL,
  `混雑予測` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- テーブルのデータのダンプ `時刻表`
--

INSERT INTO `時刻表` (`id`, `出発場所`, `出発時間`, `到着時間`, `運行ダイヤ`, `混雑予測`) VALUES
(1, '津田沼', '09:50:00', '10:00:00', '平日', NULL),
(2, '津田沼', '10:50:00', '11:00:00', '平日', NULL),
(3, '津田沼', '11:50:00', '12:00:00', '平日', 1),
(4, '津田沼', '11:55:00', '12:05:00', '平日', 1),
(5, '津田沼', '12:50:00', '13:00:00', '平日', 2),
(6, '津田沼', '12:55:00', '13:05:00', '平日', 2),
(7, '津田沼', '13:20:00', '13:30:00', '平日', 1),
(8, '津田沼', '13:50:00', '14:00:00', '平日', 1),
(9, '津田沼', '14:20:00', '14:30:00', '平日', 1),
(10, '津田沼', '14:50:00', '15:00:00', '平日', 2),
(11, '津田沼', '15:20:00', '15:30:00', '平日', 3),
(12, '津田沼', '15:50:00', '16:00:00', '平日', 3),
(13, '津田沼', '16:10:00', '16:20:00', '平日', 3),
(14, '津田沼', '16:40:00', '17:05:00', '平日', 3),
(15, '津田沼', '17:10:00', '17:20:00', '平日', 3),
(16, '津田沼', '17:50:00', '18:00:00', '平日', 3),
(17, '津田沼', '18:10:00', '18:20:00', '平日', 1),
(18, '津田沼', '19:10:00', '19:20:00', '平日', NULL),
(19, '津田沼', '19:50:00', '20:00:00', '平日', NULL),
(20, '津田沼', '20:10:00', '20:20:00', '平日', NULL),
(21, '津田沼', '11:40:00', '11:50:00', '土曜日', NULL),
(22, '津田沼', '12:00:00', '12:10:00', '土曜日', NULL),
(23, '津田沼', '12:20:00', '12:30:00', '土曜日', 1),
(24, '津田沼', '13:00:00', '13:10:00', '土曜日', 1),
(25, '津田沼', '13:20:00', '13:30:00', '土曜日', 1),
(26, '津田沼', '15:20:00', '15:30:00', '土曜日', 1),
(27, '津田沼', '15:40:00', '15:50:00', '土曜日', 1),
(28, '津田沼', '16:40:00', '17:05:00', '土曜日', NULL),
(29, '津田沼', '18:40:00', '18:50:00', '土曜日', NULL),
(30, '津田沼', '20:10:00', '20:20:00', '土曜日', NULL),
(31, '津田沼', '09:30:00', '10:40:00', '日曜日・祝日・休日', NULL),
(32, '津田沼', '11:30:00', '11:40:00', '日曜日・祝日・休日', NULL),
(33, '津田沼', '14:30:00', '14:40:00', '日曜日・祝日・休日', NULL),
(34, '津田沼', '16:30:00', '16:40:00', '日曜日・祝日・休日', NULL),
(35, '津田沼', '18:00:00', '18:10:00', '日曜日・祝日・休日', NULL),
(36, '新習志野', '08:20:00', '08:30:00', '平日', NULL),
(37, '新習志野', '09:20:00', '09:30:00', '平日', NULL),
(38, '新習志野', '10:20:00', '10:30:00', '平日', NULL),
(39, '新習志野', '10:30:00', '10:40:00', '平日', NULL),
(40, '新習志野', '11:20:00', '11:30:00', '平日', 1),
(41, '新習志野', '11:30:00', '11:40:00', '平日', 1),
(42, '新習志野', '12:20:00', '12:30:00', '平日', 2),
(43, '新習志野', '12:30:00', '12:40:00', '平日', 2),
(44, '新習志野', '13:15:00', '13:25:00', '平日', 2),
(45, '新習志野', '13:50:00', '14:00:00', '平日', 2),
(46, '新習志野', '14:15:00', '14:25:00', '平日', 3),
(47, '新習志野', '14:45:00', '14:55:00', '平日', 3),
(48, '新習志野', '15:20:00', '15:30:00', '平日', 3),
(49, '新習志野', '15:50:00', '16:00:00', '平日', 3),
(50, '新習志野', '16:40:00', '16:50:00', '平日', 3),
(51, '新習志野', '17:20:00', '17:30:00', '平日', 3),
(52, '新習志野', '17:40:00', '17:50:00', '平日', 3),
(53, '新習志野', '18:15:00', '18:30:00', '平日', 1),
(54, '新習志野', '18:40:00', '18:50:00', '平日', 1),
(55, '新習志野', '19:10:00', '19:20:00', '平日', NULL),
(56, '新習志野', '19:40:00', '19:55:00', '平日', NULL),
(57, '新習志野', '20:40:00', '20:55:00', '平日', NULL),
(58, '新習志野', '08:20:00', '08:30:00', '土曜日', NULL),
(59, '新習志野', '11:10:00', '11:20:00', '土曜日', NULL),
(60, '新習志野', '12:20:00', '12:30:00', '土曜日', 1),
(61, '新習志野', '12:40:00', '12:50:00', '土曜日', 1),
(62, '新習志野', '13:20:00', '13:30:00', '土曜日', 1),
(63, '新習志野', '15:20:00', '15:30:00', '土曜日', 1),
(64, '新習志野', '17:20:00', '17:30:00', '土曜日', NULL),
(65, '新習志野', '18:10:00', '18:25:00', '土曜日', NULL),
(66, '新習志野', '19:40:00', '19:55:00', '土曜日', NULL),
(67, '新習志野', '09:00:00', '09:10:00', '日曜日・祝日・休日', NULL),
(68, '新習志野', '10:00:00', '10:10:00', '日曜日・祝日・休日', NULL),
(69, '新習志野', '12:00:00', '12:10:00', '日曜日・祝日・休日', NULL),
(70, '新習志野', '15:00:00', '15:10:00', '日曜日・祝日・休日', NULL),
(71, '新習志野', '17:00:00', '17:10:00', '日曜日・祝日・休日', NULL);

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `時刻表`
--
ALTER TABLE `時刻表`
  ADD PRIMARY KEY (`id`);

--
-- ダンプしたテーブルのAUTO_INCREMENT
--

--
-- テーブルのAUTO_INCREMENT `時刻表`
--
ALTER TABLE `時刻表`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=72;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
